{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v3.7.0",
    "modelTopology": {
      "keras_version": "2.4.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Model",
        "config": {
          "name": "model",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [null, null],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_1"
              },
              "name": "input_1",
              "inbound_nodes": []
            },
            {
              "class_name": "STFTlayer",
              "config": {
                "name": "lambda",
                "trainable": true,
                "dtype": "float32",
                "function": "stftLayer",
                "function_type": "lambda",
                "module": "__main__",
                "output_shape": null,
                "output_shape_type": "raw",
                "output_shape_module": null,
                "arguments": {}
              },
              "name": "lambda",
              "inbound_nodes": [[["input_1", 0, 0, {}]]]
            },
            {
              "class_name": "AddAndLog",
              "config": {
                "name": "lambda_1",
                "trainable": true,
                "dtype": "float32",
                "function": "add_and_log",
                "function_type": "lambda",
                "module": "__main__",
                "output_shape": null,
                "output_shape_type": "raw",
                "output_shape_module": null,
                "arguments": {}
              },
              "name": "lambda_1",
              "inbound_nodes": [[["lambda", 0, 0, {}]]]
            },
  
            {
              "class_name": "InstantLayerNormalization",
              "config": {
                "name": "instant_layer_normalization",
                "trainable": true,
                "dtype": "float32"
              },
              "name": "instant_layer_normalization",
              "inbound_nodes": [[["lambda_1", 0, 0, {}]]]
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": { "gain": 1.0, "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              },
              "name": "lstm",
              "inbound_nodes": [[["instant_layer_normalization", 0, 0, {}]]]
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.25,
                "noise_shape": null,
                "seed": null
              },
              "name": "dropout",
              "inbound_nodes": [[["lstm", 0, 0, {}]]]
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_1",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": { "gain": 1.0, "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              },
              "name": "lstm_1",
              "inbound_nodes": [[["dropout", 0, 0, {}]]]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 513,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "dense",
              "inbound_nodes": [[["lstm_1", 0, 0, {}]]]
            },
            {
              "class_name": "Activation",
              "config": {
                "name": "activation",
                "trainable": true,
                "dtype": "float32",
                "activation": "sigmoid"
              },
              "name": "activation",
              "inbound_nodes": [[["dense", 0, 0, {}]]]
            },
            {
              "class_name": "Multiply",
              "config": {
                "name": "multiply",
                "trainable": true,
                "dtype": "float32"
              },
              "name": "multiply",
              "inbound_nodes": [
                [
                  ["lambda", 0, 0, {}],
                  ["activation", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "IFFTlayer",
              "config": {
                "name": "lambda_2",
                "trainable": true,
                "dtype": "float32",
                "function": "ifftLayer",
                "function_type": "lambda",
                "module": "__main__",
                "output_shape": null,
                "output_shape_type": "raw",
                "output_shape_module": null,
                "arguments": {}
              },
              "name": "lambda_2",
              "inbound_nodes": [
                [
                  ["multiply", 0, 0, {}],
                  ["lambda", 0, 1, {}]
                ]
              ]
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d",
                "trainable": true,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [1],
                "strides": [1],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "conv1d",
              "inbound_nodes": [[["lambda_2", 0, 0, {}]]]
            },
            {
              "class_name": "InstantLayerNormalization",
              "config": {
                "name": "instant_layer_normalization_1",
                "trainable": true,
                "dtype": "float32"
              },
              "name": "instant_layer_normalization_1",
              "inbound_nodes": [[["conv1d", 0, 0, {}]]]
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_2",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": { "gain": 1.0, "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              },
              "name": "lstm_2",
              "inbound_nodes": [[["instant_layer_normalization_1", 0, 0, {}]]]
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.25,
                "noise_shape": null,
                "seed": null
              },
              "name": "dropout_1",
              "inbound_nodes": [[["lstm_2", 0, 0, {}]]]
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_3",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": { "gain": 1.0, "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              },
              "name": "lstm_3",
              "inbound_nodes": [[["dropout_1", 0, 0, {}]]]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 256,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "dense_1",
              "inbound_nodes": [[["lstm_3", 0, 0, {}]]]
            },
            {
              "class_name": "Activation",
              "config": {
                "name": "activation_1",
                "trainable": true,
                "dtype": "float32",
                "activation": "sigmoid"
              },
              "name": "activation_1",
              "inbound_nodes": [[["dense_1", 0, 0, {}]]]
            },
            {
              "class_name": "Multiply",
              "config": {
                "name": "multiply_1",
                "trainable": true,
                "dtype": "float32"
              },
              "name": "multiply_1",
              "inbound_nodes": [
                [
                  ["conv1d", 0, 0, {}],
                  ["activation_1", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 1024,
                "kernel_size": [1],
                "strides": [1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1],
                "groups": 1,
                "activation": "linear",
                "use_bias": false,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": { "seed": null }
                },
                "bias_initializer": { "class_name": "Zeros", "config": {} },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "conv1d_1",
              "inbound_nodes": [[["multiply_1", 0, 0, {}]]]
            },
            {
              "class_name": "OverlapAddLayer",
              "config": {
                "name": "lambda_3",
                "trainable": true,
                "dtype": "float32",
                "function": "overlapAddLayer",
                "function_type": "lambda",
                "module": "__main__",
                "output_shape": null,
                "output_shape_type": "raw",
                "output_shape_module": null,
                "arguments": {}
              },
              "name": "lambda_3",
              "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]
            }
          ],
          "input_layers": [["input_1", 0, 0]],
          "output_layers": [["lambda_3", 0, 0]]
        }
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of3.bin",
          "group1-shard2of3.bin",
          "group1-shard3of3.bin"
        ],
        "weights": [
          {
            "name": "conv1d/kernel",
            "shape": [1, 1024, 256],
            "dtype": "float32"
          },
          {
            "name": "conv1d_1/kernel",
            "shape": [1, 256, 1024],
            "dtype": "float32"
          },
          { "name": "dense/kernel", "shape": [256, 513], "dtype": "float32" },
          { "name": "dense/bias", "shape": [513], "dtype": "float32" },
          { "name": "dense_1/kernel", "shape": [256, 256], "dtype": "float32" },
          { "name": "dense_1/bias", "shape": [256], "dtype": "float32" },
          {
            "name": "instant_layer_normalization/gamma",
            "shape": [513],
            "dtype": "float32"
          },
          {
            "name": "instant_layer_normalization/beta",
            "shape": [513],
            "dtype": "float32"
          },
          {
            "name": "instant_layer_normalization_1/gamma",
            "shape": [256],
            "dtype": "float32"
          },
          {
            "name": "instant_layer_normalization_1/beta",
            "shape": [256],
            "dtype": "float32"
          },
          {
            "name": "lstm/lstm_cell/kernel",
            "shape": [513, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm/lstm_cell/recurrent_kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          { "name": "lstm/lstm_cell/bias", "shape": [1024], "dtype": "float32" },
          {
            "name": "lstm_1/lstm_cell_1/kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_1/lstm_cell_1/recurrent_kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_1/lstm_cell_1/bias",
            "shape": [1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_2/lstm_cell_2/kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_2/lstm_cell_2/recurrent_kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_2/lstm_cell_2/bias",
            "shape": [1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_3/lstm_cell_3/kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_3/lstm_cell_3/recurrent_kernel",
            "shape": [256, 1024],
            "dtype": "float32"
          },
          {
            "name": "lstm_3/lstm_cell_3/bias",
            "shape": [1024],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  